<template>
    <header>
        <div class="container1">
            <a href="#">
                <svg class="logo_svg" viewBox="0 0 430 93" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M391.59 28.936H424.998V39.208H391.59V28.936ZM392.55 57.736H430V68.2H380.07V1H430V11.464H392.55V57.736Z" fill="white"/>
                    <path d="M357.59 68.2V1H370.07V68.2H357.59Z" fill="white"/>
                    <path d="M309.954 31.912H343.458V42.472H309.954V31.912ZM311.01 68.2H298.53V1H347.586V11.464H311.01V68.2Z" fill="white"/>
                    <path d="M252.438 69.12C247.19 69.12 242.358 68.256 237.942 66.528C233.526 64.8 229.686 62.4 226.422 59.328C223.158 56.192 220.63 52.544 218.838 48.384C217.046 44.16 216.15 39.552 216.15 34.56C216.15 29.568 217.046 24.992 218.838 20.832C220.63 16.608 223.158 12.96 226.422 9.888C229.686 6.752 233.526 4.32 237.942 2.592C242.358 0.864 247.158 0 252.342 0C257.59 0 262.39 0.864 266.742 2.592C271.158 4.32 274.998 6.752 278.262 9.888C281.526 12.96 284.054 16.608 285.846 20.832C287.638 24.992 288.534 29.568 288.534 34.56C288.534 39.552 287.638 44.16 285.846 48.384C284.054 52.608 281.526 56.256 278.262 59.328C274.998 62.4 271.158 64.8 266.742 66.528C262.39 68.256 257.622 69.12 252.438 69.12ZM252.342 58.176C255.734 58.176 258.87 57.6 261.75 56.448C264.63 55.296 267.126 53.664 269.238 51.552C271.35 49.376 272.982 46.88 274.134 44.064C275.35 41.184 275.958 38.016 275.958 34.56C275.958 31.104 275.35 27.968 274.134 25.152C272.982 22.272 271.35 19.776 269.238 17.664C267.126 15.488 264.63 13.824 261.75 12.672C258.87 11.52 255.734 10.944 252.342 10.944C248.95 10.944 245.814 11.52 242.934 12.672C240.118 13.824 237.622 15.488 235.446 17.664C233.334 19.776 231.67 22.272 230.454 25.152C229.302 27.968 228.726 31.104 228.726 34.56C228.726 37.952 229.302 41.088 230.454 43.968C231.67 46.848 233.334 49.376 235.446 51.552C237.558 53.664 240.054 55.296 242.934 56.448C245.814 57.6 248.95 58.176 252.342 58.176Z" fill="white"/>
                    <path d="M148.74 68.2V1H176.388C182.34 1 187.428 1.96 191.652 3.88C195.94 5.8 199.236 8.552 201.54 12.136C203.844 15.72 204.996 19.976 204.996 24.904C204.996 29.832 203.844 34.088 201.54 37.672C199.236 41.192 195.94 43.912 191.652 45.832C187.428 47.688 182.34 48.616 176.388 48.616H155.652L161.22 42.952V68.2H148.74ZM192.708 68.2L175.716 43.816H189.06L206.148 68.2H192.708ZM161.22 44.296L155.652 38.344H175.812C181.316 38.344 185.444 37.16 188.196 34.792C191.012 32.424 192.42 29.128 192.42 24.904C192.42 20.616 191.012 17.32 188.196 15.016C185.444 12.712 181.316 11.56 175.812 11.56H155.652L161.22 5.416V44.296Z" fill="white"/>
                    <path d="M82.4805 68.2V1H110.128C116.08 1 121.168 1.96 125.392 3.88C129.68 5.8 132.976 8.552 135.28 12.136C137.584 15.72 138.736 19.976 138.736 24.904C138.736 29.832 137.584 34.088 135.28 37.672C132.976 41.256 129.68 44.008 125.392 45.928C121.168 47.848 116.08 48.808 110.128 48.808H89.3925L94.9605 42.952V68.2H82.4805ZM94.9605 44.296L89.3925 38.248H109.552C115.056 38.248 119.184 37.096 121.936 34.792C124.752 32.424 126.16 29.128 126.16 24.904C126.16 20.616 124.752 17.32 121.936 15.016C119.184 12.712 115.056 11.56 109.552 11.56H89.3925L94.9605 5.416V44.296Z" fill="white"/>
                    <path d="M60 68.2V1H72.48V68.2H60Z" fill="white"/>
                    <path d="M0 93V1H15.0023V78.2003L430 78V93H0Z" fill="#55A4FF"/>
                </svg>
            </a>
            <div id="darker" @click="darker_func"></div>
            <span class="burger" id="burger_svg" @click="menu_open">
                <div></div>
                <div></div>
                <div></div>
            </span>
            <ul class="header_buttons" id="header_b">
                <li><a href="#s1_anchor" id="s1B" @click="darker_func"><b>Почему Липецк?</b></a></li>
                <li><a href="#s2_anchor" id="s2B" @click="darker_func"><b>Профессии будущего</b></a></li>
                <li><a href="#s3_anchor" id="s3B" @click="darker_func"><b>Места</b></a></li>
                <li><a href="#s4_anchor" id="s4B" @click="darker_func"><b>О проекте</b></a></li>
            </ul>
        </div>
    </header>
    <main>
        <section class="banner" id="banner">
            <div class="banner_fone" style="position:absolute;">
                <img src="../assets/img/banner_fone1.jpg" alt="">
                <img src="../assets/img/banner_fone2.jpg" alt="">
                <img src="../assets/img/banner_fone3.jpg" alt="">
            </div>
            <div class="container2">
                <h1 class="h1Text">Липецк – город возможностей!</h1>
                <span>Липецк – место, где будущее начинается сегодня</span>
            </div>
            <a href="#s1_anchor">
                <svg viewBox="0 0 114 77" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M4.07109 16.5355C6.02372 14.5829 9.18954 14.5829 11.1422 16.5355L64.1752 69.5685L62.761 70.9828C59.6368 74.1069 54.5714 74.107 51.4472 70.9828L4.07109 23.6066C2.11847 21.654 2.11847 18.4882 4.07109 16.5355Z" fill="#FFF"/>
                    <path d="M50 69.5686L103.033 16.5356C104.986 14.583 108.151 14.583 110.104 16.5356C112.057 18.4882 112.057 21.654 110.104 23.6067L62.7279 70.9828C59.6037 74.107 54.5384 74.107 51.4142 70.9828L50 69.5686Z" fill="#FFF"/>
                    <path d="M54 28.2843L80.5165 1.7678C81.4928 0.791488 83.0757 0.791487 84.052 1.7678C85.0283 2.74411 85.0283 4.32702 84.052 5.30333L59.6569 29.6985C58.4853 30.8701 56.5858 30.8701 55.4142 29.6985L54 28.2843Z" fill="#55a4ff"/>
                    <path d="M30.7678 1.76777C31.7441 0.791456 33.327 0.791456 34.3033 1.76777L60.8198 28.2843L59.4056 29.6985C58.234 30.8701 56.3345 30.8701 55.1629 29.6985L30.7678 5.3033C29.7914 4.32699 29.7914 2.74408 30.7678 1.76777Z" fill="#55a4ff"/>
                </svg>
            </a>
        </section>
        <div class="anchor" id="s1_anchor"></div>
        <section class="container2 s1" id="s1">
            <h2 class="h1Text moveMaker">Почему Липецк?</h2>
            <div class="moveMaker">
                <span>В Липецке у молодых специалистов есть отличные карьерные перспективы благодаря развитым промышленным предприятиям и растущему числу инновационных стартапов. Город предлагает разнообразие вакансий и возможности для профессионального роста, обеспечивая благоприятную среду для начала успешной карьеры.</span>
            </div>
            <div class='fone_icon'><svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" width="500" height="500" x="0" y="0" viewBox="0 0 64 64" style="enable-background:new 0 0 512 512" xml:space="preserve" class=""><g><g data-name="graduation cap-world-globe-book-education"><path d="M62 45a3.009 3.009 0 0 0-3-3H40.21A18.01 18.01 0 0 0 50 26a17.493 17.493 0 0 0-.26-2.91l11.73-6.21a1 1 0 0 0-.06-1.79l-29-13a.979.979 0 0 0-.82 0l-29 13a1 1 0 0 0-.06 1.79L6 18.72v4.42A4 4 0 0 0 3 27v3a1 1 0 0 0 1 1h6a1 1 0 0 0 1-1v-3a4 4 0 0 0-3-3.86v-3.36l6.26 3.31A17.493 17.493 0 0 0 14 26a18.01 18.01 0 0 0 9.79 16H12a10 10 0 0 0 0 20h47a3 3 0 0 0 0-6v-8a3.009 3.009 0 0 0 3-3Zm-30-3a15.958 15.958 0 0 1-8-2.16v-8.43l3.59-3.59 1.86-.93a1 1 0 0 0 .52-1.13l-1-4a1 1 0 0 0-.73-.73l-4-1a.975.975 0 0 0-.48 0l-3.81.95-2.98-.42a16.021 16.021 0 0 1 4.13-6.24l3.3 2.48a.6.6 0 0 0 .15.09l4 2a1 1 0 0 0 .29.1l6 1A.86.86 0 0 0 35 20a.984.984 0 0 0 .83-.45l1.81-2.71 2.68-.89a1.058 1.058 0 0 0 .39-.24l1.77-1.77a15.611 15.611 0 0 1 2.34 2.53l-3.44 2.75c-.03.02-.06.05-.09.07l-2.85 2.86-4.81 1.92a.768.768 0 0 0-.18.1l-3 2a1.007 1.007 0 0 0-.44.67l-1 6a.993.993 0 0 0 .54 1.05L33 35.62V38a1 1 0 0 0 1 1h4a.967.967 0 0 0 .55-.17l2.64-1.75 1.86.46A15.906 15.906 0 0 1 32 42Zm-9.31-28.98a15.905 15.905 0 0 1 18.19-.32l-1.42 1.43-2.78.92a.962.962 0 0 0-.51.4l-1.64 2.46-5.22-.87-3.78-1.89Zm21.88 22.84-3.33-.83a.963.963 0 0 0-.79.14L37.7 37H35v-2a.977.977 0 0 0-.55-.89l-3.34-1.67.81-4.85 2.55-1.7 4.9-1.96a1.105 1.105 0 0 0 .34-.22l2.96-2.96 3.25-2.61a15.889 15.889 0 0 1-1.35 17.72ZM9 27v2H5v-2a2 2 0 0 1 4 0ZM5.28 16.07 32 4.1l26.72 11.97-9.42 5a17.985 17.985 0 0 0-34.6 0Zm17.01 14.22A1.033 1.033 0 0 0 22 31v7.47A15.968 15.968 0 0 1 16 26a15.585 15.585 0 0 1 .4-3.5l3.46.49c.13-.01.25-.01.38-.02l3.76-.94 3.18.79.66 2.64-1.29.65c-.08.06-.17.12-.26.18ZM14 46a6 6 0 0 0 0 12h45a1 1 0 0 1 0 2H12a8 8 0 0 1 0-16h47a1 1 0 0 1 0 2Zm43 2v8H14a4 4 0 0 1 0-8Z" fill="#55a4ff" opacity="1" data-original="#000000" class=""/><path d="M14 50v2h30v3a.984.984 0 0 0 .53.88.977.977 0 0 0 1.02-.05L48 54.2l2.45 1.63A1 1 0 0 0 52 55v-3h3v-2Zm36 3.13-1.45-.96a.975.975 0 0 0-1.1 0l-1.45.96V52h4Z" fill="#55a4ff" opacity="1" data-original="#000000" class=""/></g></g></svg></div>
        </section>
        <section class="s2_fone">
            <div class="anchor" id="s2_anchor"></div>
            <div v-if="render" class="container2 s2" id="s2">
                <h2 class="h1Text moveMaker">Профессии будущего</h2>
                <div class="posterBlock moveMaker">
                    <div class="posterBlockSlide" v-for="prof in professions">
                        <div></div>
                        <router-link :to='"/profession/" + prof.id' :style="'background-image: url(' + prof.img1 + ')'">
                            <div>
                                <h3>{{ prof.title }}</h3>
                                <span>{{ prof.text }}</span>
                            </div>
                        </router-link>
                    </div>
                </div>
            </div>
        </section>
        <div class="anchor" id="s3_anchor"></div>
        <section class="container2 s3" id="s3">
            <h2 class="h1Text moveMaker">Места</h2>
            <div class="moveMaker posterBlock2">
                <div v-for="place in places">
                    <div></div>
                    <router-link to="#" :style="'background-image: url(' + place.img + ')'">
                        <div>
                            <h3>{{ place.title }}</h3>
                            <span>{{ place.text }}</span>
                        </div>
                    </router-link>
                </div>
<!--                <div v-for="dostoprem in dostoprems">-->
<!--                    <div></div>-->
<!--                    <router-link to='/profession/1' style="background-image: url(' media_url  {{ dostoprem.img }} ')">-->
<!--                        <div>-->
<!--                            <h3>{{ dostoprem.name }}</h3>-->
<!--                            <span>{{ dostoprem.description }}</span>-->
<!--                        </div>-->
<!--                    </router-link>-->
<!--                </div>-->
            </div>
            <div class='fone_icon'>
                <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" width="500" height="500" x="0" y="0" viewBox="0 0 512 512" style="enable-background:new 0 0 512 512" xml:space="preserve" class=""><g><path d="M472.208 201.712c9.271-9.037 12.544-22.3 8.544-34.613-4.001-12.313-14.445-21.118-27.257-22.979l-112.03-16.279a6.75 6.75 0 0 1-5.084-3.694L286.28 22.632c-5.729-11.61-17.331-18.822-30.278-18.822s-24.549 7.212-30.278 18.822l-50.101 101.516a6.756 6.756 0 0 1-5.085 3.694L58.51 144.12c-12.812 1.861-23.255 10.666-27.257 22.979-4.002 12.313-.728 25.576 8.544 34.613l81.065 79.019a6.755 6.755 0 0 1 1.942 5.978l-19.137 111.576c-2.188 12.761 2.958 25.414 13.432 33.024 10.474 7.612 24.102 8.595 35.56 2.572l100.201-52.679a6.751 6.751 0 0 1 6.286 0l100.202 52.679c4.984 2.62 10.377 3.915 15.744 3.914 6.97 0 13.896-2.184 19.813-6.487 10.474-7.611 15.621-20.265 13.432-33.024L389.2 286.708a6.758 6.758 0 0 1 1.942-5.978l81.066-79.018zm-109.629 89.564 19.137 111.578c.64 3.734-1.665 5.863-2.686 6.604-1.022.74-3.76 2.277-7.112.513l-100.202-52.679a33.76 33.76 0 0 0-31.424-.001l-100.201 52.678c-3.354 1.763-6.091.228-7.112-.513s-3.327-2.87-2.686-6.604l19.137-111.576a33.755 33.755 0 0 0-9.711-29.886l-81.065-79.019c-2.713-2.646-2.099-5.723-1.708-6.923.389-1.201 1.702-4.052 5.451-4.596l112.027-16.279a33.76 33.76 0 0 0 25.424-18.471l50.101-101.516c1.677-3.397 4.793-3.764 6.056-3.764 1.261 0 4.377.366 6.055 3.764v.001l50.101 101.516a33.754 33.754 0 0 0 25.422 18.471l112.029 16.279c3.749.544 5.061 3.395 5.451 4.596.39 1.201 1.005 4.279-1.709 6.923l-81.065 79.019a33.754 33.754 0 0 0-9.71 29.885zM413.783 22.625c-6.036-4.384-14.481-3.046-18.865 2.988l-14.337 19.732c-4.384 6.034-3.047 14.481 2.988 18.865a13.456 13.456 0 0 0 7.928 2.58c4.177 0 8.295-1.931 10.937-5.567l14.337-19.732c4.384-6.035 3.047-14.482-2.988-18.866zM131.36 45.265l-14.337-19.732c-4.383-6.032-12.829-7.37-18.865-2.988-6.034 4.384-7.372 12.831-2.988 18.865l14.337 19.732a13.485 13.485 0 0 0 10.939 5.569c2.753 0 5.531-.839 7.927-2.581 6.034-4.383 7.372-12.83 2.987-18.865zM49.552 306.829c-2.305-7.093-9.924-10.976-17.019-8.671l-23.197 7.538c-7.095 2.305-10.976 9.926-8.671 17.019 1.854 5.709 7.149 9.337 12.842 9.337 1.383 0 2.79-.215 4.177-.666l23.197-7.538c7.094-2.305 10.976-9.924 8.671-17.019zM256.005 456.786c-7.459 0-13.506 6.047-13.506 13.506v24.392c0 7.459 6.047 13.506 13.506 13.506 7.459 0 13.506-6.047 13.506-13.506v-24.392c0-7.46-6.046-13.506-13.506-13.506zM502.664 305.715l-23.197-7.538c-7.092-2.303-14.714 1.577-17.019 8.672-2.305 7.095 1.576 14.714 8.671 17.019l23.197 7.538a13.51 13.51 0 0 0 4.176.664c5.694 0 10.989-3.629 12.843-9.337 2.305-7.094-1.577-14.713-8.671-17.018z" fill="#55a4ff" opacity="1" data-original="#000000"/></g></svg>
                <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" width="500" height="500" x="0" y="0" viewBox="0 0 512 512" style="enable-background:new 0 0 512 512" xml:space="preserve" class=""><g><path d="M472.208 201.712c9.271-9.037 12.544-22.3 8.544-34.613-4.001-12.313-14.445-21.118-27.257-22.979l-112.03-16.279a6.75 6.75 0 0 1-5.084-3.694L286.28 22.632c-5.729-11.61-17.331-18.822-30.278-18.822s-24.549 7.212-30.278 18.822l-50.101 101.516a6.756 6.756 0 0 1-5.085 3.694L58.51 144.12c-12.812 1.861-23.255 10.666-27.257 22.979-4.002 12.313-.728 25.576 8.544 34.613l81.065 79.019a6.755 6.755 0 0 1 1.942 5.978l-19.137 111.576c-2.188 12.761 2.958 25.414 13.432 33.024 10.474 7.612 24.102 8.595 35.56 2.572l100.201-52.679a6.751 6.751 0 0 1 6.286 0l100.202 52.679c4.984 2.62 10.377 3.915 15.744 3.914 6.97 0 13.896-2.184 19.813-6.487 10.474-7.611 15.621-20.265 13.432-33.024L389.2 286.708a6.758 6.758 0 0 1 1.942-5.978l81.066-79.018zm-109.629 89.564 19.137 111.578c.64 3.734-1.665 5.863-2.686 6.604-1.022.74-3.76 2.277-7.112.513l-100.202-52.679a33.76 33.76 0 0 0-31.424-.001l-100.201 52.678c-3.354 1.763-6.091.228-7.112-.513s-3.327-2.87-2.686-6.604l19.137-111.576a33.755 33.755 0 0 0-9.711-29.886l-81.065-79.019c-2.713-2.646-2.099-5.723-1.708-6.923.389-1.201 1.702-4.052 5.451-4.596l112.027-16.279a33.76 33.76 0 0 0 25.424-18.471l50.101-101.516c1.677-3.397 4.793-3.764 6.056-3.764 1.261 0 4.377.366 6.055 3.764v.001l50.101 101.516a33.754 33.754 0 0 0 25.422 18.471l112.029 16.279c3.749.544 5.061 3.395 5.451 4.596.39 1.201 1.005 4.279-1.709 6.923l-81.065 79.019a33.754 33.754 0 0 0-9.71 29.885zM413.783 22.625c-6.036-4.384-14.481-3.046-18.865 2.988l-14.337 19.732c-4.384 6.034-3.047 14.481 2.988 18.865a13.456 13.456 0 0 0 7.928 2.58c4.177 0 8.295-1.931 10.937-5.567l14.337-19.732c4.384-6.035 3.047-14.482-2.988-18.866zM131.36 45.265l-14.337-19.732c-4.383-6.032-12.829-7.37-18.865-2.988-6.034 4.384-7.372 12.831-2.988 18.865l14.337 19.732a13.485 13.485 0 0 0 10.939 5.569c2.753 0 5.531-.839 7.927-2.581 6.034-4.383 7.372-12.83 2.987-18.865zM49.552 306.829c-2.305-7.093-9.924-10.976-17.019-8.671l-23.197 7.538c-7.095 2.305-10.976 9.926-8.671 17.019 1.854 5.709 7.149 9.337 12.842 9.337 1.383 0 2.79-.215 4.177-.666l23.197-7.538c7.094-2.305 10.976-9.924 8.671-17.019zM256.005 456.786c-7.459 0-13.506 6.047-13.506 13.506v24.392c0 7.459 6.047 13.506 13.506 13.506 7.459 0 13.506-6.047 13.506-13.506v-24.392c0-7.46-6.046-13.506-13.506-13.506zM502.664 305.715l-23.197-7.538c-7.092-2.303-14.714 1.577-17.019 8.672-2.305 7.095 1.576 14.714 8.671 17.019l23.197 7.538a13.51 13.51 0 0 0 4.176.664c5.694 0 10.989-3.629 12.843-9.337 2.305-7.094-1.577-14.713-8.671-17.018z" fill="#55a4ff" opacity="1" data-original="#000000"/></g></svg>
            </div>
        </section>
        <div class="anchor" id="s4_anchor"></div>
        <section class="container2 s4" id="s4">
            <h2 class="h1Text moveMaker">О проекте</h2>
            <div class="moveMaker">
                <span><b>Разработчик: </b>Команда CodeMakers</span>
                <span>Сайт создан в рамках хакатона DigitalCode</span>
            </div>
            <div class='fone_icon'><svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" width="500" height="500" x="0" y="0" viewBox="0 0 482.13 482.13" style="enable-background:new 0 0 512 512" xml:space="preserve" class=""><g><path d="M475.266 126.603h-.002l-.016-.016-31.12-4.44a8 8 0 0 1-3.672-14.32l25.152-18.864a8 8 0 0 0 1.6-11.2l-28.8-38.4a8 8 0 0 0-11.2-1.6l-25.144 18.864a8 8 0 0 1-12.752-7.528l4.448-31.12a8 8 0 0 0-6.783-9.055l-.009-.001-47.488-6.784a8 8 0 0 0-9.056 6.782v.002l-4.448 31.12a8 8 0 0 1-14.32 3.672L292.8 18.563a8 8 0 0 0-11.2-1.6l-24.04 18.04a154.787 154.787 0 0 0-32.72 0C153.614 43.144 97.759 99.946 90.816 171.299c-.216 2.264-.296 4.512-.408 6.76h-2.4a8 8 0 0 0-7.824 6.4l-5.528 26.288-22.144-15.272a8 8 0 0 0-10.2.928l-24 24a8 8 0 0 0-.928 10.192l15.2 22.104-26.296 5.528A8 8 0 0 0 0 266.059v32a8 8 0 0 0 6.352 7.832l26.296 5.528-15.2 22.104a8 8 0 0 0 .928 10.192l24 24a8 8 0 0 0 10.2.928l22.104-15.24 5.528 26.296a8 8 0 0 0 7.824 6.4h32a8 8 0 0 0 7.832-6.352l5.528-26.296 22.104 15.2a8 8 0 0 0 10.192-.928l12.424-12.464v22.8a31.896 31.896 0 0 0 16 27.552v44.448c0 17.673 14.327 32 32 32h32c17.673 0 32-14.327 32-32v-44.448a31.896 31.896 0 0 0 16-27.552v-31.664a39.2 39.2 0 0 1 18.504-32.656 153.525 153.525 0 0 0 18.832-14.4l-10.672-11.92a136.188 136.188 0 0 1-16.856 12.888 55.104 55.104 0 0 0-25.808 46.088v31.664c0 8.837-7.163 16-16 16h-64c-8.837 0-16-7.163-16-16v-32.328a53.824 53.824 0 0 0-25.376-45.152c-63.407-39.842-82.511-123.541-42.669-186.948a135.593 135.593 0 0 1 114.325-63.452 8.698 8.698 0 0 0-.312.872 8 8 0 0 0 1.528 5.928l18.856 25.144a7.832 7.832 0 0 1 .48 8.88 7.952 7.952 0 0 1-8 3.848l-31.12-4.448a8 8 0 0 0-9.055 6.783l-.001.009-6.792 47.512a8.001 8.001 0 0 0 6.783 9.055l.009.001 31.12 4.448a8 8 0 0 1 3.672 14.32l-25.144 18.856a8 8 0 0 0-1.6 11.2l28.8 38.4a8 8 0 0 0 11.2 1.6l25.152-18.856a8 8 0 0 1 12.712 7.528l-4.44 31.12a8 8 0 0 0 6.782 9.056h.002l47.52 6.792c.374.048.751.072 1.128.072a8 8 0 0 0 7.928-6.864l4.44-31.12a8 8 0 0 1 14.32-3.672l18.864 25.144a8 8 0 0 0 11.2 1.6l38.4-28.8a8 8 0 0 0 1.6-11.2l-18.856-25.144a7.863 7.863 0 0 1-.48-8.88 7.768 7.768 0 0 1 8-3.84l31.12 4.44a8 8 0 0 0 9.056-6.782v-.002l6.784-47.52a8 8 0 0 0-6.782-9.056zM210.112 410.059h64v16h-64v-16zm0 32h64v8c0 8.837-7.163 16-16 16h-32c-8.837 0-16-7.163-16-16v-8zm-63.688-137.96a151.206 151.206 0 0 0 13.672 9.96 39.05 39.05 0 0 1 16.12 20.472l-17.16 17.128-16.616-11.456c-7.276-5.014-17.239-3.18-22.254 4.096a16.003 16.003 0 0 0-2.482 5.784l-4.192 19.976H94.496l-4.192-19.944c-1.82-8.647-10.305-14.182-18.952-12.362a16.003 16.003 0 0 0-5.784 2.482l-16.624 11.424-14.576-14.544 11.448-16.608c5.019-7.273 3.191-17.237-4.082-22.256a15.994 15.994 0 0 0-5.79-2.488L16 291.563v-19.008l19.944-4.2c8.644-1.833 14.166-10.326 12.333-18.971a15.996 15.996 0 0 0-2.453-5.725l-11.456-16.656 14.576-14.544 16.632 11.456c7.279 5.009 17.242 3.169 22.251-4.11a15.983 15.983 0 0 0 2.477-5.778l1.4-6.656a152.347 152.347 0 0 0 6.344 27.128c-26.323 3.138-45.118 27.022-41.98 53.345 3.138 26.323 27.022 45.118 53.345 41.98a48.004 48.004 0 0 0 37.011-25.725zM134 292.827c-5.974 16.605-24.277 25.223-40.882 19.25-16.605-5.974-25.223-24.277-19.25-40.882a31.952 31.952 0 0 1 30.131-21.136h.304A151.512 151.512 0 0 0 134 292.827zm326.512-119.856-23.2-3.312c-13.122-1.874-25.278 7.245-27.152 20.366-.9 6.301.74 12.702 4.56 17.794l14.056 18.744-25.6 19.2-14.064-18.736c-7.952-10.605-22.995-12.756-33.599-4.804a24.004 24.004 0 0 0-9.361 15.804l-3.24 23.232-31.672-4.528 3.312-23.2c1.879-13.121-7.235-25.281-20.356-27.159a23.998 23.998 0 0 0-17.804 4.559l-18.744 14.056-19.2-25.6 18.736-14.064c10.605-7.952 12.756-22.995 4.804-33.599a24.004 24.004 0 0 0-15.804-9.361l-23.2-3.312 4.528-31.672 23.2 3.312c13.121 1.879 25.281-7.235 27.159-20.356a23.998 23.998 0 0 0-4.559-17.804l-14.104-18.76 25.6-19.2 14.064 18.744c7.952 10.605 22.995 12.756 33.599 4.804a24.004 24.004 0 0 0 9.361-15.804l3.312-23.2 31.672 4.52-3.312 23.2c-1.874 13.122 7.244 25.278 20.366 27.152 6.301.9 12.702-.74 17.794-4.56l18.744-14.056 19.2 25.6-18.744 14.064c-10.605 7.952-12.756 22.995-4.804 33.599a24.004 24.004 0 0 0 15.804 9.361l23.2 3.312-4.552 31.664z" fill="#55a4ff" opacity="1" data-original="#000000" class=""/><path d="M344 76.171c-35.346 0-64 28.654-64 64 0 35.346 28.654 64 64 64 35.346 0 64-28.654 64-64-.04-35.33-28.67-63.961-64-64zm0 112c-26.51 0-48-21.49-48-48s21.49-48 48-48 48 21.49 48 48c-.031 26.497-21.503 47.969-48 48zM234.112 354.059h16v24h-16zM207.12 275.491c-49.385-19.292-73.78-74.966-54.487-124.351a96.005 96.005 0 0 1 38.279-46.313l-8.552-13.536c-52.336 32.971-68.035 102.126-35.064 154.462a112.001 112.001 0 0 0 54.016 44.626c19.752 7.568 32.795 26.528 32.8 47.68h16c.025-27.752-17.077-52.641-42.992-62.568zM394.112 298.059h56v16h-56zM380.993 352.2l10.241-12.293 48.004 39.994-10.242 12.292zM346.112 362.059h16v56h-16zM8.169 138.29l63.996-15.996 3.878 15.513-63.996 15.998zM21.458 56.572l9.295-13.013 55.995 39.996-9.294 13.013zM90.003 4.03l15.5-3.963 16.363 63.995-15.5 3.963z" fill="#55a4ff" opacity="1" data-original="#000000" class=""/></g></svg></div>
        </section>
    </main>
</template>

<script setup lang="ts">
    import {onBeforeMount, onBeforeUpdate, onMounted, onUnmounted, type Ref, ref} from "vue";
    import $ from "jquery";
    import "slick-carousel";
    import "slick-carousel/slick/slick.css";
    import "@/assets/css/style.css";
    import axios from "axios";
    import type { Professions, Places } from '@/types';

    let ch2 = false, hght, cont1 = true, cont2 = true;


    // МАССИВ ДОСТОПРИМЕЧАТЕЛЬНОСТЕЙ
    let places: Ref<Places[]> = ref([
        // {
        //     'name': 'Памятник героям Первой мировой войны',
        //     'description': 'Памятник был создан по инициативе Российского военно-исторического общества и Администрации Липецкой области. Его автором стал народный художник Российской Федерации Александр Иулианович Рукавишников. Торжественное открытие памятника состоялось 8 августа 2014 года на перекрёстке улиц Циолковского и Терешковой в Липецке. В открытии приняли участие руководитель департамента военно-исторического наследия Российского военно-исторического общества Алексей Лебедев, заместитель министра культуры Российской Федерации Алла Манилова и глава администрации Липецкой области Олег Королёв.  Памятник героям Первой мировой войны представляет собой трёхгранную стелу:  Основная идея – что это трёхгранное сечение стелы — это все-таки ассоциация со штыком должна быть, потому что штык трёхгранный бывает часто. Мне кажется, что стела попала на место. Не «ломает» город, улицу — не мешает, не портит. Вроде как будто она здесь и была А. И. Рукавишников.  Высота стелы составляет 19,5 метров. В верхней её части помещена изготовленная из бронзы фигура двуглавого орла, несколько ниже по граням стелы расположены фигуры Георгиевских крестов. У основания стелы её огибает металлический постамент с надписью «Слава героям Великой войны».',
        //     'img': 'img/img112.jpg'
        // },
        // {
        //     'name': 'Соборная площадь',
        //     'description': 'Главная площадь Липецка — Ленина-Соборная. Здесь проходят важные события, праздники. У нее своя история, которую бережно хранит городское архивное управление.  Известно, что площадь на Соборной горе в конце XVIII века представляла собой поле, где пасся скот. Здесь же размещались и деревянные строения соляных магазинов и «кладовая, где хранилась денежная казна». Место стало публичным лишь после Гражданской войны. В 1918 году Соборную площадь переименовали в Интернациональную и назначили постоянным местом проведения митингов, манифестаций и демонстраций.  Христо-Рождественский кафедральный собор был возведен по повелению императрицы Екатерины Алексеевны и строился почти полстолетия — с конца XVIII до середины XIX века. Первый престол нового храма имени Николая Чудотворца освятили уже в 1805 году. Однако когда большая часть работ уже была выполнена, случился пожар — многое пришлось строить и отделывать заново.  В приделе Христо-Рождественского собора хранится икона Божией Матери «Липецкая», считающаяся чудотворной. По преданию, когда в 1831 году в Липецке началась эпидемия холеры, жители обратились с молитвами к иконе Богоматери. И после крестного хода эпидемия пошла на убыль.  Решение о возведении соборной колокольни было принято в 1822 году. В начале XX века на ней насчитывалось восемь колоколов. Одна из ее отличительных черт — башенные часы, которые установили еще в конце 1850-х годов.  В 1902 году в храме появилось отопление с паровым насосом. Еще до 1917 года сюда провели водопровод и даже электрическое освещение с 800 лампочками. После революции 1917 года храм был разграблен, а с 1931 года закрыт для верующих. До середины пятидесятых годов прошлого века в соборе был склад, а в притворе и трапезной располагался краеведческий музей.',
        //     'img': 'img/img102.jpg'
        // },
        // {
        //     'name': 'Площадь Авиаторов',
        //     'description': 'Площадь Авиаторов — крупная площадь в Советском округе Липецка. Расположена на пересечении улицы Гагарина и улицы Космонавтов.  Первоначально — в 1968 году — площадь была названа в честь 50-летия ВЛКСМ. В 1969 году на ней установили памятник героям-авиаторам по проекту архитектора Н. Р. Полунина. Памятник представлял собой самолёт, поставленный на высокий постамент.   Памятник авиаторам — МиГ-19 до реконструкции 18 июля 2003 года (к официальному 300-летию Липецка) рядом с ним открыли новый памятник — погибшим лётчикам липецкого авиацентра С. М. Шерстобитову и Л. А. Кривенкову (ск. И. М. Мазур и Ю. Д. Гришко, арх. В. Н. Павлов и Л. А. Павлова). 17 декабря 1968 года они ценой своих жизней увели терпящий бедствие самолёт от жилых кварталов Липецка. Одновременно с созданием памятника серебристый самолёт перекрасили в белый цвет.  Нынешнее имя площадь получила 13 января 1992 года.  В 1985 году на развилке улиц Гагарина и Космонавтов был возведён первый (и единственный) 16-этажный жилой дом—"трилистник" (ул. Космонавтов, 2; арх. В. Д. Тягунов, Э. Е. Серова, Б. П. Канцане и Г. М. Александров).  С северной стороны на площадь выходит фасад Дома культуры трубного завода (ул. Гагарина, 74). Теперь это — Театр кукол, здание имеет статус  памятник архитектуры.  С юга к площади примыкает штаб Липецкого авиацентра имени В. П. Чкалова (ул. Гагарина, 61а).',
        //     'img': 'img/img92.jpg'
        // },
        // {
        //     'name': 'Театр кукол',
        //     'description': '6 июля 1965 года был создан Липецкий государственный театр кукол. Первый театральный сезон был открыт спектаклем «Честное слово» по произведению С.Михайлова.  Теперь уже историей стали имена директора Галины Николаевны Боковой, главного художника — заслуженного работника культуры РСФСР А.Ф.Бобылкина, актёров: заслуженного артиста РСФСР В.Теплякова, заслуженной артистки РФ И.Герасимовой, заслуженного артиста Украины В.Лесового, заслуженной артистки Украины В.Сучковой, заслуженной артистки Республики Крым В.Васильевой  Осенью 1968 года главным режиссёром театра был приглашён молодой актёр и режиссёр Крымского театра кукол Вадим Жуков. С приходом В. В. Жукова, главного режиссера театра, началось творческое формирование коллектива. «Аленький цветочек» был его дебютной работой в театре. А работ было много, и, каждый новый спектакль был примечателен новыми сценическими находками и актёрскими работами.  В это период театр открывает свою гастрольную деятельность: Ленинград, Ленинградская область, Калининград, города Казахстана, страны Африки — Мозамбик и Ангола, Винница, Крым, Киров, многие города Черноземья.  Гастроли театра в г. Москве в 1977 году принесли ему немалую известность и признание, спектакль «Ищи ветра в поле» В. Лившица был удостоен премии Министра культуры СССР, а на международном фестивале в г. Опале (Польша) получил приз, как лучший спектакль гостей фестиваля, а так же вошёл в число лучших спектаклей страны.  В 1978 году при Липецком отделении ВТО (Всероссийское театральное общество), СТД (Союз театральных деятелей), на базе театра кукол, создаётся Лаборатория для профессиональных режиссёров и художников. Обмениваясь опытом, театры 15-ти областей (Рязань, Курск, Брянск, Белгород и др.), получали бесценный материал для работы и творческих поисков. Лаборатория просуществовала 15 лет.  В 1988 году, со спектаклем «Мальчик Горошек» театр принимал участие в фестивале «Посиделки» в г. Воронеже.  В 2001 году, со спектаклем «Теремок» в постановке народного артиста РФ В.Жукова, Липецкий театр кукол принимал участие в Московском Международном фестивале театров кукол, посвящённом 100-летию выдающегося деятеля театрального искусства – Сергея Владимировича Образцова.  В 2005 году, со спектаклем «Как Иван-дурак царевичем стал» в постановке народного артиста РФ В.Жукова, принял участие в Международном фестивале театров кукол России, Украины и Белоруссии в г. Белгороде.  Лишь по прошествии 33-х лет со дня создания, в 1998 году, театр получил своё здание, свой дом, свою сцену и начал планомерную творческую работу.  С 2007 по 2020  год возглавлял театр заслуженный артист РФ Олег Витальевич Пономарев-талантливый режиссер, поставивший немало интересных спектаклей, среди которых: «Золотой цыпленок» (В. Орлов), «Трубадур и его друзья» (Г. Гладков), «Сказка о рыбаке и рыбке» (А. Пушкин) и многие другие.  За годы деятельности театр приобрел свой индивидуальный творческий стиль, сложились добрые традиции, сохранена преемственность поколений, передается опыт от старшего поколения молодым артистам. В репертуаре   появились вечерние спектакли, а живая актерская игра заняла почетное место на уровне с мастерством артистов- кукловодов.',
        //     'img': 'img/img82.jpg'
        // },
        // {
        //     'name': 'Быханов сад',
        //     'description': '«Быханов сад» является парком культуры и отдыха, который сформирован в 1954 году на территории питомника Липецкого зеленхоза, который ранее, в свою очередь, был организован на базе питомника плодовых и лесопарковых культур уроженца Липецка и известного липецкого садовода — Василия Васильевича Быханова (1829—1896), брата выдающегося русского ученого предложившего теорию дрейфа материков — Евграфа Васильевича Быханова (1839—1915). Первоначально, в 1954 году, парк получил имя — Комсомо́льский.  В 1967 году в парке открывается памятник учителю и комсомольскому вожаку В. Н. Скороходову. (ск. Ю. Д. Гришко, арх. Н. Р. Полунин). В его честь парк переименован в парк и́мени В. Н. Скорохо́дова.  30 июня 1993 года парк переименовали в Быха́нов сад.  По периметру парка (вдоль улиц Балмочных и Тельмана) сохраняются деревянные частные дома. На востоке Быханов сад ограничивает здание спортивного комплекса «Спартак» (ул. Гагарина, 70а), первая очередь которого, была сдана в 1968 году.  Ботаническая ценность парка определяется наличием деревьев — экзотов, таких как ель колючая, клён псевдоплатановый, робиния псевдоакация, области распространения которых находятся на разных континентах. Кроме того, на территории парка живёт ряд видов птиц: горлица кольчатая, поползень обыкновенный, рябинник, свиристель, стриж чёрный.',
        //     'img': 'img/img72.jpg'
        // },
        // {
        //     'name': 'Христорождественский собор',
        //     'description': 'Строительство храма было завершено в 1842 году. Собор построен по указу императрицы Екатерины Алексеевны, благословению Святейшего синода и преосвященного Иннокентия, епископа Воронежского.  Согласно традиционной точке зрения, строительство каменной соборной церкви Рождества Христова началось в 1791 году. Возведение храмовой части Христорождественского собора в основном было завершено к 1803 году, но освятить построенный храм удалось не сразу: произошёл пожар, во время которого сгорели все деревянные части собора, сильно пострадал и основной объём здания. К 1805 году соборная церковь была вновь открыта усердием многих благотворителей, а 20 июня 1805 года освящён первый престол нового храма — во имя святого Николая Чудотворца.  Главный соборный престол в честь Рождества Христова освятили 25 мая 1807 года. Именно с этого времени к Христорождественскому храму от Вознесенской церкви, который стоял на нынешней Театральной площади, переходит функция соборного храма Липецка. Третий престол в храмовой части (правый, в южном приделе) был освящён в 1816 году.  В 1822 году было принято решение о возведении соборной колокольни, спроектированной в строгом классическом стиле. Строительство её было начато в 1825 году, а завершено в 1835 году. В начале XX века на колокольне Христорождественского собора насчитывалось восемь колоколов. Самый крупный, весивший 489 пудов и отлитый в 1859 году, был перелит в 1900 году.   Соборная площадь После сооружения колокольни наступил довольно длительный перерыв в строительстве собора. И только когда разные по высоте и массе объёмы колокольни и храмовой части стабилизировались, была начата постройка трапезной. Каменная трапезная была пристроена в 1840—1842 годах, руководил работами протоиерей Андрей Иванович Калугин. Два престола в трапезной церкви были освящены в честь Смоленской иконы Божией Матери Одигитрии в 1841 году (левый) и Воздвижения Животворящего Креста Господня в 1842 году (правый). Строительством трапезной и освящением престолов завершилось возведение главного соборного храма Липецка.',
        //     'img': 'img/img62.jpg'
        // }
    ]);
    // МАССИВ ДОСТОПРИМЕЧАТЕЛЬНОСТЕЙ


    // МАССИВ ПРОФЕССИЙ
    let professions: Ref<Professions[]> = ref([
        // {
        //     'name': 'Инженеры в области возобновляемой энергетики',
        //     'description': 'Липецкий регион активно развивает проекты в сфере «зеленой» энергии, поэтому специалисты в этой области будут крайне востребованы.',
        //     'img1': 'img/img11.jpg',
        //     'img2': 'img/img11_1.jpg'
        // },
        // {
        //     'name': 'IT-специалисты',
        //     'description': 'Развитие цифровых технологий требует квалифицированных программистов, разработчиков приложений и специалистов по кибербезопасности.',
        //     'img1': 'img/img10.jpg',
        //     'img2': 'img/img10_1.jpg'
        // },
        // {
        //     'name': 'Медицинские работники',
        //     'description': 'С ростом населения и развитием медицинских учреждений спрос на врачей, медсестер и других медработников остается высоким.',
        //     'img1': 'img/img9.jpg',
        //     'img2': 'img/img9_1.jpg'
        // },
        // {
        //     'name': 'Специалисты по маркетингу и рекламе',
        //     'description': 'В условиях растущего бизнеса и конкуренции за внимание потребителей навыки продвижения товаров и услуг становятся все более важными.',
        //     'img1': 'img/img8.jpg',
        //     'img2': 'img/img8_1.jpg'
        // },
        // {
        //     'name': 'Экологи и специалисты по устойчивому развитию',
        //     'description': 'Вопросы экологии и устойчивого развития выходят на первый план, и профессионалы в этих областях будут играть ключевую роль в формировании будущего города.',
        //     'img1': 'img/img7.jpg',
        //     'img2': 'img/img7_1.jpg'
        // }
    ]);
    // МАССИВ ПРОФЕССИЙ

    const loadProfessions = async () => {
        let res = await axios.get(window.origin + '/api/professions/');
        professions.value = res.data;
    };

    const loadPlaces = async () => {
        let res = await axios.get(window.origin + '/api/places/');
        places.value = res.data;
    };

    let render: Ref<boolean> = ref(false);
    loadProfessions();
    loadPlaces();
    onUnmounted(() => {
        render.value = false;
    });

    function scrollChecker() {
        if (window.pageYOffset > 0) {
            $('header').addClass("smallHeader");
            $('.banner, .banner_fone').css({ "border-radius": "0 0 40px 20px" });
        } else {
            $('header').removeClass("smallHeader");
            $('.banner, .banner_fone').css({ "border-radius": "0" });
        }

        hght = document.documentElement.clientHeight;
        for (let i = 1; i <= 4; i++) {
            let sObj = document.getElementById(`s${i}`);
            if(!sObj){
                continue;
            }

            let eltop_elhght = sObj.offsetTop + sObj.clientHeight - 10 // element scrolltop + element height
            if (i == 2) eltop_elhght = sObj.offsetTop + sObj.clientHeight - 100

            if (window.pageYOffset >= sObj.offsetTop - 100 && window.pageYOffset < eltop_elhght) {
                $(`#s${i}B`).removeClass('hSelectedOut');
                $(`#s${i}B`).addClass('hSelectedIn');
            } else {
                $(`#s${i}B`).removeClass('hSelectedIn');
                $(`#s${i}B`).addClass('hSelectedOut');
            }

            let translateSet = {'x': 0, 'y': 300};
            if (i == 4) translateSet = {'x': -300, 'y': 0};

            if (window.pageYOffset + hght >= sObj.offsetTop + (hght * 0.1)) $(`#s${i}`).children("h2.moveMaker").css({ "transform": "translate(0, 0)", "opacity": "1" });
            else $(`#s${i}`).children("h2").css({ "transform": `translate(${translateSet.x}px, ${translateSet.y}px)`, "opacity": "0" });
            if (window.pageYOffset + hght >= sObj.offsetTop + (hght * 0.2)) $(`#s${i}`).children("div.moveMaker").css({ "transform": "translate(0, 0)", "opacity": "1" });
            else $(`#s${i}`).children("div.moveMaker").css({ "transform": `translate(${translateSet.x}px, ${translateSet.y}px)`, "opacity": "0" });
        }
    }

    function menu_open() {
        if (cont1) {
            header_b.style.right = "0px";
            burger_svg.style.right = "300px";
            burger_svg.classList.add("close");
            darker.style.display = "block";
            setTimeout(() => { darker.style.opacity = "1" }, 0.001);
            cont1 = false;
        } else {
            header_b.style.right = "-300px";
            burger_svg.style.right = "0px";
            burger_svg.classList.remove("close");
            darker.style.opacity = "0";
            setTimeout(() => { darker.style.display = "none" }, 300);
            cont1 = true;
            cont2 = false;
        }
    }

    function darker_func() {
        cont1 = false;
        menu_open();
    }

    onMounted(() => {
        render.value = true;
        window.addEventListener('scroll', () => { scrollChecker() });
        scrollChecker();

        window.addEventListener('mousemove', function(event) {
            document.querySelectorAll('.fone_icon').forEach((element) => {
                let translateX = (event.clientX - window.innerWidth / 2) * 0.03;
                let translateY = (event.clientY - window.innerHeight / 2) * 0.03;
                element.style.transform = `translate(${ translateX }px, ${ translateY }px)`;
            });
        });

        $(document).ready(async function ($) {
            $('.banner_fone').slick({
                slidesToScroll: 1,
                autoplay: true,
                arrows: false,
                fade: true,
                autoplaySpeed: 5000,
                speed: 1000,
            });


            loadProfessions().then(res => {
                loadPlaces().then(res => {
                    setTimeout(() => {
                        $('.posterBlock').slick({
                            slidesToScroll: 1,
                            infinite: true,
                            slidesToShow: 2,
                            autoplay: true,
                            arrows: true,
                            prevArrow: `<div class="prevArrowSlider"><div></div></div>`,
                            nextArrow: `<div class="nextArrowSlider"><div></div></div>`,
                            autoplaySpeed: 2500,
                            speed: 1000,
                            responsive: [
                                {
                                    breakpoint: 605,
                                    settings: {
                                        slidesToShow: 1
                                    }
                                }
                            ]
                        });
                    }, 1000)
                });
            });
        });
    });
</script>
